## Pandas - manipolazioni

In [1]:
import pandas as pd

t1 = pd.DataFrame()
print(t1)

Empty DataFrame
Columns: []
Index: []

In [2]:
t2 = pd.DataFrame(['mele', 'pere', 'kiwi'])
t2

      0
0  mele
1  pere
2  kiwi

In [3]:
t3 = pd.DataFrame(data=[['mele', 100, 1.3],['pere', 200, 2.3],['kiwi', 40, 3.9]])
t3

      0    1    2
0  mele  100  1.3
1  pere  200  2.3
2  kiwi   40  3.9

In [7]:
fruit = pd.Series(data=['mele', 'pere', 'kiwi'], index=[12,23,34])
mag = pd.Series(data=[100,200,300], index=[12,23,34])
shop = pd.DataFrame({'frutta':fruit, 'qta':mag})
shop

   frutta  qta
12   mele  100
23   pere  200
34   kiwi  300

In [8]:
fruit = pd.Series(data=['mele', 'pere', 'kiwi', 'fragole'], index=[12,23,34,55])
mag = pd.Series(data=[100,200,300,1000], index=[12,23,34,999])
shop = pd.DataFrame({'frutta':fruit, 'qta':mag})
shop

      frutta     qta
12      mele   100.0
23      pere   200.0
34      kiwi   300.0
55   fragole     NaN
999      NaN  1000.0

In [9]:
shop.iloc[4]

frutta       NaN
qta       1000.0
Name: 999, dtype: object

In [10]:
shop.loc[999]

frutta       NaN
qta       1000.0
Name: 999, dtype: object

In [11]:
shop.loc[999] = ['noci', 1000]
shop

      frutta     qta
12      mele   100.0
23      pere   200.0
34      kiwi   300.0
55   fragole     NaN
999     noci  1000.0

In [13]:
shop.iloc[3] = ['fragole', 99]
shop

      frutta     qta
12      mele   100.0
23      pere   200.0
34      kiwi   300.0
55   fragole    99.0
999     noci  1000.0

In [14]:
shop.loc[66] = ['pomodori', 222]
shop

       frutta     qta
12       mele   100.0
23       pere   200.0
34       kiwi   300.0
55    fragole    99.0
999      noci  1000.0
66   pomodori   222.0

In [15]:
shop2 = shop.drop(999)
shop2

      frutta    qta
12      mele  100.0
23      pere  200.0
34      kiwi  300.0
55   fragole   99.0
66  pomodori  222.0

In [16]:
shop

       frutta     qta
12       mele   100.0
23       pere   200.0
34       kiwi   300.0
55    fragole    99.0
999      noci  1000.0
66   pomodori   222.0

In [17]:
shop3 = shop.drop('qta', axis=1)
shop3

       frutta
12       mele
23       pere
34       kiwi
55    fragole
999      noci
66   pomodori

In [18]:
shop.index

Index([12, 23, 34, 55, 999, 66], dtype='int64')

In [19]:
shop.index[-1]

np.int64(66)

In [20]:
shop4 = shop.drop(shop.index[-1])
shop4

      frutta     qta
12      mele   100.0
23      pere   200.0
34      kiwi   300.0
55   fragole    99.0
999     noci  1000.0

In [21]:
shop

       frutta     qta
12       mele   100.0
23       pere   200.0
34       kiwi   300.0
55    fragole    99.0
999      noci  1000.0
66   pomodori   222.0

In [22]:
ff = pd.Series(data=['patate', 'sedano', 'insalata'], index=[2,3,4])
mm = pd.Series(data=[10,20,30], index=[2,3,4])
orto = pd.DataFrame({'frutta':ff, 'qta':mm})
orto

     frutta  qta
2    patate   10
3    sedano   20
4  insalata   30

In [25]:
glob = pd.concat([shop, orto])
glob

       frutta     qta
12       mele   100.0
23       pere   200.0
34       kiwi   300.0
55    fragole    99.0
999      noci  1000.0
66   pomodori   222.0
2      patate    10.0
3      sedano    20.0
4    insalata    30.0

In [26]:
glob2 = pd.concat([shop, orto]).reset_index(drop=True)
glob2

     frutta     qta
0      mele   100.0
1      pere   200.0
2      kiwi   300.0
3   fragole    99.0
4      noci  1000.0
5  pomodori   222.0
6    patate    10.0
7    sedano    20.0
8  insalata    30.0

In [31]:
for i in shop.index:
    print(i, end=' ')
    el = shop.loc[i]
    #print(el)
    print(el['frutta'])

12 mele
23 pere
34 kiwi
55 fragole
999 noci
66 pomodori

In [33]:
for indice, row in shop.iterrows():
    print(indice, row.frutta, row.qta)

12 mele 100.0
23 pere 200.0
34 kiwi 300.0
55 fragole 99.0
999 noci 1000.0
66 pomodori 222.0

In [34]:
glob2

     frutta     qta
0      mele   100.0
1      pere   200.0
2      kiwi   300.0
3   fragole    99.0
4      noci  1000.0
5  pomodori   222.0
6    patate    10.0
7    sedano    20.0
8  insalata    30.0

In [36]:
for colonna,contenuto in glob2.items():
    print(colonna)
    print(contenuto)

frutta
0        mele
1        pere
2        kiwi
3     fragole
4        noci
5    pomodori
6      patate
7      sedano
8    insalata
Name: frutta, dtype: object
qta
0     100.0
1     200.0
2     300.0
3      99.0
4    1000.0
5     222.0
6      10.0
7      20.0
8      30.0
Name: qta, dtype: float64